Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_КоммерческоеПредложениеКлиенту/TK_КоммерческоеПредложениеКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_КоммерческоеПредложениеКлиенту</name>
  <basedOn>Document.TK_ЗапросЦенОтКлиента</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросЦенОтКлиента</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенОтКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Налогообложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтрокиЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторВерсииСтрокиЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрошеннаяНоменклатура</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрошеннаяНоменклатураТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрошенноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрошеннаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗапрошеннаяДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийДляПокупателя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнутреннийКомментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Пропустить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/Enums/TK_СтатусыПубликацииДокументовНаTeklifo/TK_СтатусыПубликацииДокументовНаTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TK_СтатусыПубликацииДокументовНаTeklifo</name>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>НеОпубликован</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОбновление</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенОтКлиента/TK_ЗапросЦенОтКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_ЗапросЦенОтКлиента</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.TK_ТипыЗапросовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_КоммерческоеПредложениеКлиенту/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет коммерческое предложение на основании данных запроса цен от клиента.
Процедура ЗаполнитьНаОснованииЗапросаЦенОтКлиента() Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	TK_ЗапросЦенОтКлиента.Организация КАК Организация,
						  |	TK_ЗапросЦенОтКлиента.Партнер КАК Партнер,
						  |	TK_ЗапросЦенОтКлиента.Контрагент КАК Контрагент,
						  |	TK_ЗапросЦенОтКлиента.Валюта КАК Валюта,
						  |	TK_ЗапросЦенОтКлиента.Товары.(
						  |		ИдентификаторСтроки КАК ИдентификаторСтрокиЗапроса,
						  |		ИдентификаторВерсии КАК ИдентификаторВерсииСтрокиЗапроса,
						  |		Номенклатура КАК ЗапрошеннаяНоменклатура,
						  |		НоменклатураТекстом КАК ЗапрошеннаяНоменклатураТекстом,
						  |		Количество КАК ЗапрошенноеКоличество,
						  |		МаксимальнаяЦена КАК ЗапрошеннаяЦена,
						  |		ДатаДоставки КАК ЗапрошеннаяДатаДоставки,
						  |		Комментарий КАК КомментарийЗапроса) КАК Товары
						  |ИЗ
						  |	Документ.TK_ЗапросЦенОтКлиента КАК TK_ЗапросЦенОтКлиента
						  |ГДЕ
						  |	TK_ЗапросЦенОтКлиента.Ссылка = &ЗапросЦенОтКлиента");
	Запрос.УстановитьПараметр("ЗапросЦенОтКлиента", ЗапросЦенОтКлиента);

	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Если ВыборкаШапка.Следующий() Тогда

		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);

		Товары.Очистить();
		ВыборкаТовары = ВыборкаШапка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			СтрокаТабличнойЧасти = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаТовары);
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Менеджер = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.TK_ЗапросЦенОтКлиента") Тогда

		ЗапросЦенОтКлиента = ДанныеЗаполнения;
		ЗаполнитьНаОснованииЗапросаЦенОтКлиента();

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для Каждого СтрокаТабличнойЧасти Из Товары Цикл

		Если СтрокаТабличнойЧасти.Пропустить Тогда
			Продолжить;
		КонецЕсли;

		ИндексСтроки = СтрокаТабличнойЧасти.НомерСтроки - 1;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("Номенклатура", НСтр("ru = 'Номенклатура'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Количество) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("Количество", НСтр("ru = 'Количество'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Цена) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("Цена", НСтр("ru = 'Цена'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Сумма) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("Сумма", НСтр("ru = 'Сумма'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтавкаНДС) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("СтавкаНДС", НСтр("ru = 'СтавкаНДС'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СуммаСНДС) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("СуммаСНДС", НСтр("ru = 'СуммаСНДС'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.ДатаДоставки) Тогда
			СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти("ДатаДоставки", НСтр("ru = 'ДатаДоставки'"), ИндексСтроки);
			Отказ = Истина;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("СуммаСНДС");

	Если ЭтоНовый() Тогда
		ТекущийСтатус = Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.ПустаяСсылка();
		ДокументИзменен = Ложь;
	Иначе
		ТекущийСтатус = TK_ОбщегоНазначенияВызовСервера.СтатусПубликацииЗапросаЦенПоставщикам(Ссылка);
		ДокументИзменен = ОбменДаннымиСобытия.ДанныеРазличаются(ЭтотОбъект, Ссылка.ПолучитьОбъект(), ,
			"Комментарий, Менеджер");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ТекущийСтатус", ТекущийСтатус);
	ДополнительныеСвойства.Вставить("ДокументИзменен", ДокументИзменен);

	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекущийСтатус = Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.ПустаяСсылка();
	ДокументИзменен = Ложь;

	ДополнительныеСвойства.Свойство("ТекущийСтатус", ТекущийСтатус);
	ДополнительныеСвойства.Свойство("ДокументИзменен", ДокументИзменен);

	Если Не ЗначениеЗаполнено(ТекущийСтатус) Тогда
		TK_ОбщегоНазначенияВызовСервера.УстановитьСтатусПубликацииКоммерческогоПредложенияКлиенту(Ссылка,
			Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.НеОпубликован);
	ИначеЕсли ТекущийСтатус = Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.Опубликован И ДокументИзменен Тогда
		TK_ОбщегоНазначенияВызовСервера.УстановитьСтатусПубликацииКоммерческогоПредложенияКлиенту(Ссылка,
			Перечисления.TK_СтатусыПубликацииДокументовНаTeklifo.ТребуетсяОбновление);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьОбОшибкеЗаполненияСтрокиТабличнойЧасти(ИмяПоля, ПредставлениеПоля, ИндексСтроки)

	ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Поле ""%1"" не заполнено.'"), ПредставлениеПоля), ,
		СтрШаблон("Товары[%1].%2", ИндексСтроки, ИмяПоля), "Объект");

КонецПроцедуры

#КонецОбласти

#КонецЕсли
